tavdog/SmartMatrix-ESP32/src/main.cpp
#include <Arduino.h>
#include <ArduinoLog.h>

extern "C" {
#include "freertos/FreeRTOS.h"
#include "freertos/timers.h"
}

#include <Adafruit_Sensor.h>
#include <Adafruit_TSL2561_U.h>
#include <ArduinoJson.h>
#include <AsyncMqtt_Generic.h>
#include <ESP32-HUB75-MatrixPanel-I2S-DMA.h>
#include <FS.h>
#include <WiFiManager.h>
#include <Wire.h>
#include <webp/decode.h>
#include <webp/demux.h>

#include <esp32fota.hpp>

#include "LittleFS.h"
#include "secrets.h"

const char *manifestURL =
    "http://pub-34eaf0d2dcbb40c396065db28dcc4418.r2.dev/manifest.json";
#ifdef TIDBYT

#define R1 21
#define G1 2
#define BL1 22
#define R2 23
#define G2 4
#define BL2 27

#define CH_A 26
#define CH_B 5
#define CH_C 25
#define CH_D 18
#define CH_E -1 // assign to pin 14 if using more than two panels

#define LAT 19
#define OE 32
#define CLK 33

// Initialize the panel.
//HUB75_I2S_CFG::i2s_pins _pins = {R1, G1, BL1, R2, G2, BL2, CH_A, CH_B, CH_C, CH_D, CH_E, LAT, OE, CLK};
  HUB75_I2S_CFG::i2s_pins _pins = { 2, 22,  21,  4, 27,  23,   26,    5,   25,   18,   -1,  19, 32, 33}; // what actually works for me
HUB75_I2S_CFG mxconfig(64,                     // width
                       32,                     // height
                       1,                      // chain length
                       _pins,                   // pin mapping
                       HUB75_I2S_CFG::FM6126A, // driver chip
                       true,                   // double-buffering
                       HUB75_I2S_CFG::HZ_10M);
#else
HUB75_I2S_CFG::i2s_pins _pins = {25, 26, 27, 14, 12, 13, 23,
                                 19, 5,  17, -1, 4,  15, 16};
HUB75_I2S_CFG mxconfig(64, 32, 1, _pins);
#endif

MatrixPanel_I2S_DMA matrix = MatrixPanel_I2S_DMA(mxconfig);

Adafruit_TSL2561_Unified tsl =
    Adafruit_TSL2561_Unified(TSL2561_ADDR_FLOAT, 12345);

char hostName[18];
char appletTopic[26];
char statusTopic[26];
char commandTopic[27];
char scheduleTopic[28];
char asyncAppletName[30];
char tmpFileName[20];
char realFileName[20];

static uint8_t spriteBuffer[60000];
static uint8_t decBuffer[4 * MATRIX_WIDTH * MATRIX_HEIGHT];
static WebPData webPData;
WebPAnimDecoder *dec = NULL;

int desiredBrightness = 50;
int currentBrightness = 100;

bool newApplet;
bool hasApplet;
bool hasSentBootMessage;
bool newStatusApplet;
bool needToDecodeSchedule = true;
bool tslEnabled;
bool updateStarted;

AsyncMqttClient client;
WiFiManager wifiManager;
esp32FOTA esp32FOTA("SmartMatrix32", APP_VERSION, false, true);

float luxLevel;

TaskHandle_t matrixTask;
TaskHandle_t scheduleTask;
TimerHandle_t mqttReconnectTimer;

File pushingAppletFile;

int currentAppletExecutionDuration = 0;

unsigned long lastTSLCheckTime = 0;
unsigned long lastAdjustBrightnessTime = 0;
unsigned long currentAppletExecutionStartTime = 0;
unsigned long lastHeartbeatTime = 0;
unsigned long lastOTACheckTime = 0;
unsigned long updateStartTime;

int currentAppletID = 0;
int pushingAppletID = 0;

int scheduledItemsCount;
int durations[50];
bool skipStates[50];
bool pinStates[50];
StaticJsonDocument<2048> docIn;
StaticJsonDocument<200> docOut;
char jsonMessageBuf[200];

void publish(const char *topic, const char *message) {
    client.publish(topic, 1, false, message);
    Log.traceln("[smx/mqtt] publishing %s to topic: %s", message, topic);
}

int showApplet(const char *applet) {
    char appletPath[30];
    sprintf(appletPath, "/%s.webp", applet);
    Log.traceln("[smx/dec] attepting to decode %s", applet);
    if (LittleFS.exists(appletPath)) {
        File file = LittleFS.open(appletPath, FILE_READ);
        // Set buffers
        hasApplet = false;
        newApplet = false;

        Log.traceln("[smx/dec] file %s: %d bytes", applet, (int)file.size());

        // Fill buffer!
        file.readBytes((char *)spriteBuffer, file.size());

        webPData.size = file.size();
        webPData.bytes = spriteBuffer;

        // Attempt to decode applet
        int w = 0;
        int h = 0;
        int validity = WebPGetInfo(webPData.bytes, webPData.size, &w, &h);
        if (validity) {
            Log.traceln("[smx/dec] preemptive decoding succeeded for %s",
                        applet);
            newApplet = true;
            hasApplet = true;
            return 1;
        } else {
            Log.errorln("[smx/dec] preemptive decoding failed for %s", applet);
            return 2;
        }
    } else {
        Log.warningln("[smx/dec] %s not found", applet);
        return 0;
    }
}

void updateLux() {
    // sensors_event_t event;
    // //tsl.getEvent(&event);
    // luxLevel = event.light;
    // if (luxLevel > 10) {
    //     desiredBrightness = 100;
    // } else if (luxLevel > 0) {
    //     desiredBrightness = 30;
    // } else {
    //     desiredBrightness = 0;
    //}
}

void showAppletAsync(const char *applet) {
    strcpy(asyncAppletName, applet);
    newStatusApplet = true;
}

void configModeCallback(WiFiManager *wm) {
    Log.traceln("[smx/wifi] entering setup mode");
    if (!hasSentBootMessage) {
        showAppletAsync("setup");
    }
}
void saveConfigCallback() {
    Log.traceln("[smx/wifi] exiting setup mode");
    if (!hasSentBootMessage) {
        showAppletAsync("connect_wifi");
    }
}

void connectToMqtt() {
    Log.traceln("[smx/mqtt] connecting to %s:%d", MQTT_HOST, MQTT_PORT);
    if (!hasSentBootMessage) {
        showAppletAsync("connect_cloud");
    }
    client.connect();
}

void WiFiEvent(WiFiEvent_t event) {
    switch (event) {
        case ARDUINO_EVENT_WIFI_STA_GOT_IP6:
        case ARDUINO_EVENT_WIFI_STA_GOT_IP:
            Log.traceln("[smx/wifi] got connection event");
            connectToMqtt();
            break;

        case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
            Log.traceln("[smx/wifi] got disconnection event");
            xTimerStop(mqttReconnectTimer, 0);
            break;
        default:
            break;
    }
}

void onMqttConnect(bool sessionPresent) {
    Log.traceln("[smx/mqtt] connected to %s:%d", MQTT_HOST, MQTT_PORT);
    client.subscribe(commandTopic, 2);
    client.subscribe(appletTopic, 2);
    client.subscribe(scheduleTopic, 2);
    if (!hasSentBootMessage) {
        hasSentBootMessage = true;
        docOut.clear();
        docOut["type"] = "boot";
        serializeJson(docOut, jsonMessageBuf);
        publish(statusTopic, jsonMessageBuf);
        showAppletAsync("ready");
    }
}

