tavdog/SmartMatrix-ESP32/src/main.cpp
void onMqttDisconnect(AsyncMqttClientDisconnectReason reason) {
    Log.traceln("[smx/mqtt] disconnected");
    if (WiFi.isConnected()) {
        xTimerStart(mqttReconnectTimer, 0);
    }
}

void onMqttMessage(char *topic, char *payload,
                   const AsyncMqttClientMessageProperties &properties,
                   const size_t &len, const size_t &index,
                   const size_t &total) {
    if (strcmp(topic, commandTopic) == 0) {
        Log.traceln("[smx/mqtt] received command: %s", payload);
        // Receiving new applet manifest!

        deserializeJson(docIn, payload);
        const char *command = docIn["command"];
        if (strcmp(command, "send_app_graphic") == 0) {
            pushingAppletFile.close();
            pushingAppletID = atoi(docIn["params"]["appid"]);

            sprintf(tmpFileName, "/app/%d.webp.tmp", pushingAppletID);

            if (LittleFS.exists(tmpFileName)) {
                LittleFS.remove(tmpFileName);
            }

            pushingAppletFile = LittleFS.open(tmpFileName, FILE_WRITE);
            docOut.clear();
            docOut["type"] = "success";
            docOut["info"] = "applet_update";
            docOut["next"] = "send_chunk";
            serializeJson(docOut, jsonMessageBuf);
            publish(statusTopic, jsonMessageBuf);
        } else if (strcmp(command, "app_graphic_stop") == 0) {
            pushingAppletFile.close();

            sprintf(tmpFileName, "/app/%d.webp.tmp", pushingAppletID);
            LittleFS.remove(tmpFileName);
            docOut.clear();
            docOut["type"] = "success";
            docOut["info"] = "applet_update";
            docOut["next"] = "send_next";
            serializeJson(docOut, jsonMessageBuf);
            publish(statusTopic, jsonMessageBuf);
        } else if (strcmp(command, "app_graphic_sent") == 0) {
            pushingAppletFile.close();

            // Move temp file to real applet
            sprintf(realFileName, "/app/%d.webp", pushingAppletID);

            if (LittleFS.rename(tmpFileName, realFileName)) {
                docOut.clear();
                docOut["type"] = "success";
                docOut["info"] = "applet_update";
                docOut["next"] = "none";
                serializeJson(docOut, jsonMessageBuf);
                publish(statusTopic, jsonMessageBuf);
            }
        } else if (strcmp(command, "device_reboot") == 0) {
            ESP.restart();
        } else if (strcmp(command, "device_reset") == 0) {
            wifiManager.resetSettings();
            ESP.restart();
        } else if (strcmp(command, "ping") == 0) {
            docOut.clear();
            docOut["type"] = "pong";
            serializeJson(docOut, jsonMessageBuf);
            publish(statusTopic, jsonMessageBuf);
        }
    } else if (strcmp(topic, appletTopic) == 0) {
        if (index == 0) {
            Log.traceln("[smx/applet] receiving %d bytes for %d", (int)total,
                        pushingAppletID);
        }
        pushingAppletFile.write((uint8_t *)payload, len);
        if (index + len >= total) {
            Log.traceln("[smx/applet] stored %d bytes for %d", (int)total,
                        pushingAppletID);
            docOut.clear();
            docOut["type"] = "success";
            docOut["info"] = "applet_update";
            docOut["next"] = "send_chunk";
            serializeJson(docOut, jsonMessageBuf);
            publish(statusTopic, jsonMessageBuf);
        }
    } else if (strcmp(topic, scheduleTopic) == 0) {
        File scheduleFile =
            LittleFS.open("/app/schedule.json.tmp", FILE_APPEND);
        scheduleFile.write((uint8_t *)payload, len);
        scheduleFile.close();
        if (index + len >= total) {
            Log.traceln(
                "[smx/mqtt] ready to decode received schedule: %d bytes",
                (int)total);
            needToDecodeSchedule = true;
        }
    }
    docIn.clear();
    docIn.garbageCollect();
}

bool needForceUpdateApplet;
int forceUpdateAppletID;

void forceUpdateApplet(int id) {
    Log.traceln("[smx/applet] forcing update of %d", id);
    forceUpdateAppletID = id;
    needForceUpdateApplet = true;
}

void scheduleLoop(void *parameter) {
    int schedCheckID = -1;
    for (;;) {
        vTaskDelay(1000);
        if (millis() - currentAppletExecutionStartTime >
            currentAppletExecutionDuration) {
            if (scheduledItemsCount == 0) {
                continue;
            }

            int tcID = schedCheckID;
            schedCheckID++;

            if (schedCheckID >= scheduledItemsCount) {
                schedCheckID = 0;
                tcID = scheduledItemsCount - 1;
            }

            bool currentAppletPinned = pinStates[tcID];
            bool skipApplet = skipStates[schedCheckID];
            int duration = durations[schedCheckID];

            if (currentAppletPinned) {
                Log.traceln("[smx/schedule] %d is pinned", tcID);
                continue;
            }

            if (skipApplet) {
                Log.traceln("[smx/schedule] skipping %d", schedCheckID);
                continue;
            }

            Log.traceln("[smx/schedule] time to show %d", schedCheckID);

            char newAppletName[10];
            sprintf(newAppletName, "app/%d", schedCheckID);
            int result = showApplet(newAppletName);
            if (result == 0) {
                forceUpdateApplet(schedCheckID);
            } else if (result == 1) {
                currentAppletID = schedCheckID;
                currentAppletExecutionStartTime = millis();
                currentAppletExecutionDuration = duration * 1000;

                docOut.clear();
                docOut["type"] = "success";
                docOut["info"] = "applet_displayed";
                docOut["appid"] = currentAppletID;
                serializeJson(docOut, jsonMessageBuf);
                publish(statusTopic, jsonMessageBuf);
            } else if (result == 2) {
                forceUpdateApplet(schedCheckID);
            }
        }
    }
}

void matrixLoop(void *parameter) {
    unsigned long animStartTS = 0;
    int lastFrameTimestamp = 0;
    int currentFrame = 0;
    int errorCount = 0;

