tavdog/SmartMatrix-ESP32/src/main.cpp
    for (;;) {
        if (hasApplet) {
            if (newApplet && webPData.bytes != 0) {
                Log.traceln("[smx/display] new applet");
                newApplet = false;
                WebPAnimDecoderDelete(dec);
                dec = WebPAnimDecoderNew(&webPData, NULL);
                if (dec == NULL) {
                    hasApplet = false;
                    continue;
                }
                animStartTS = millis();
                lastFrameTimestamp = 0;
                currentFrame = 0;
                errorCount = 0;
            } else {
                if (millis() - animStartTS > lastFrameTimestamp) {
                    if (currentFrame == 0) {
                        animStartTS = millis();
                        lastFrameTimestamp = 0;
                    }

                    bool hasMoreFrames = WebPAnimDecoderHasMoreFrames(dec);

                    if (hasMoreFrames) {
                        uint8_t *buf;
                        if (WebPAnimDecoderGetNext(dec, &buf,
                                                   &lastFrameTimestamp)) {
                            int px = 0;
                            for (int y = 0; y < MATRIX_HEIGHT; y++) {
                                for (int x = 0; x < MATRIX_WIDTH; x++) {
                                    matrix.writePixel(
                                        x, y,
                                        matrix.color565(buf[px * 4],
                                                         buf[px * 4 + 1],
                                                         buf[px * 4 + 2]));

                                    px++;
                                }
                            }
                            delay(1000);
                            matrix.clearScreen();
                            delay(1000);
                            currentFrame++;
                            if (!WebPAnimDecoderHasMoreFrames(dec)) {
                                currentFrame = 0;
                                WebPAnimDecoderReset(dec);
                            }
                        } else {
                            Log.errorln("[smx/display] decode error for %d",
                                        currentAppletID);
                            char appletName[20];
                            sprintf(appletName, "app/%d", currentAppletID);
                            showAppletAsync(appletName);
                            errorCount++;
                            if (errorCount > 3) {
                                currentAppletExecutionStartTime = 0;
                            }
                            hasApplet = false;
                        }
                    }
                }
            }
        }

        if (newStatusApplet) {
            newStatusApplet = false;
            showApplet(asyncAppletName);
        }

        vTaskDelay(30);
    }
}

void setup() {
    Serial.begin(115200);
    Log.begin(LOG_LEVEL_VERBOSE, &Serial);
    Log.noticeln("[smx/setup] starting up");
    if (!matrix.begin()) {
        Log.errorln("[smx/setup] matrix begin failed");
    }
    Log.errorln("[smx/setup] matrix begine succeeded");
    matrix.fillScreenRGB888(0, 0, 0);
    Log.errorln("[smx/setup] blanking screen");
    matrix.setBrightness8(currentBrightness); // 0-255
    //marqueeText("SmartMx", matrix.color565(0, 255, 255));

    Wire.begin();
    if (!LittleFS.begin(true)) {
        Log.errorln("[smx/setup] couldn't init littlefs");
        ESP.restart();
    }

    LittleFS.mkdir("/app");
    esp32FOTA.setManifestURL(manifestURL);

    Log.traceln("[smx/setup] ota manifest: %s", manifestURL);

    // tslEnabled = tsl.begin();
    // if (tslEnabled) {
    //     Log.traceln("[smx/setup] tsl enabled");
    //     updateLux();
    //     tsl.enableAutoRange(true);
    //     tsl.setIntegrationTime(TSL2561_INTEGRATIONTIME_13MS);
    // }

    wifiManager.setDebugOutput(false);

    matrix.setBrightness8(desiredBrightness);  // 0-255
    matrix.clearScreen();

    xTaskCreatePinnedToCore(matrixLoop,   /* Function to implement the task */
                            "MatrixTask", /* Name of the task */
                            5000,         /* Stack size in words */
                            NULL,         /* Task input parameter */
                            30,           /* Priority of the task */
                            &matrixTask,  /* Task handle. */
                            0);           /* Core where the task should run */

    xTaskCreatePinnedToCore(scheduleLoop,   /* Function to implement the task */
                            "ScheduleTask", /* Name of the task */
                            3500,           /* Stack size in words */
                            NULL,           /* Task input parameter */
                            1,              /* Priority of the task */
                            &scheduleTask,  /* Task handle. */
                            1);             /* Core where the task should run */

    showAppletAsync("boot");

    uint8_t baseMac[6];
    char macFull[6];
    esp_read_mac(baseMac, ESP_MAC_WIFI_STA);
    sprintf(macFull, "%02X%02X%02X", baseMac[3], baseMac[4], baseMac[5]);
    snprintf(hostName, 18, PSTR("SmartMatrix%s"), macFull);

    WiFi.setHostname(hostName);
    WiFi.setAutoReconnect(true);

    esp_read_mac(baseMac, ESP_MAC_WIFI_STA);
    sprintf(macFull, "%02X%02X%02X", baseMac[3], baseMac[4], baseMac[5]);
    snprintf_P(appletTopic, 26, PSTR("smartmatrix/%s/applet"), macFull);
    snprintf_P(statusTopic, 26, PSTR("smartmatrix/%s/status"), macFull);
    snprintf_P(commandTopic, 27, PSTR("smartmatrix/%s/command"), macFull);
    snprintf_P(scheduleTopic, 28, PSTR("smartmatrix/%s/schedule"), macFull);

    mqttReconnectTimer =
        xTimerCreate("mqttTimer", pdMS_TO_TICKS(2000), pdFALSE, (void *)0,
                     reinterpret_cast<TimerCallbackFunction_t>(connectToMqtt));

    WiFi.onEvent(WiFiEvent);

    esp32FOTA.setUpdateFinishedCb([](int partition, bool restart_after) {
        Log.noticeln("[smx/ota] update finished, took %lms",
                     millis() - updateStartTime);

        if (restart_after) {
            ESP.restart();
        }
    });

    client.onConnect(onMqttConnect);
    client.onDisconnect(onMqttDisconnect);
    client.onMessage(onMqttMessage);
    client.setServer(MQTT_HOST, MQTT_PORT);
    // only set password if they are not blank
    if (String(MQTT_USERNAME).length() > 0) {
        client.setCredentials(MQTT_USERNAME, MQTT_PASSWORD);
    }
}

unsigned long lastReportHeapTime = 0;

void loop() {
    // OTA
    if ((millis() - lastOTACheckTime > 60000 || lastOTACheckTime == 0) &&
        WiFi.isConnected() && !updateStarted) {
        Log.traceln("[smx/ota] checking for update");
        lastOTACheckTime = millis();
        if (esp32FOTA.execHTTPcheck()) {
            Log.noticeln("[smx/ota] starting update at %l", millis());
            updateStarted = true;
            updateStartTime = millis();
            esp32FOTA.execOTA();
        } else {
            Log.traceln("[smx/ota] up to date, running ver %d", APP_VERSION);
        }
    }

