tavdog/SmartMatrix-ESP32/src/main.cpp
    if (millis() - lastReportHeapTime > 5000) {
        lastReportHeapTime = millis();
        docOut.garbageCollect();
        docIn.garbageCollect();
        Log.traceln("[smx/loop] free heap: %l", (long)esp_get_free_heap_size());
    }

    // In case update fucks
    if (millis() - updateStartTime > 300000 && updateStarted) {
        Log.errorln("[smx/ota] update timeout");
        ESP.restart();
    }

    // Heartbeat
    if (millis() - lastHeartbeatTime > 10000 && client.connected()) {
        lastHeartbeatTime = millis();
        docOut.clear();
        docOut["type"] = "heartbeat";
        docOut["appid"] = currentAppletID;
        docOut["heap"] = esp_get_free_heap_size();
        docOut["uptime"] = floor(esp_timer_get_time() / 1000000);
        docOut["appver"] = APP_VERSION;
        if (tslEnabled) {
            docOut["lux"] = luxLevel;
        }
        serializeJson(docOut, jsonMessageBuf);
        publish(statusTopic, jsonMessageBuf);
    }

    // Update lux level
    if (millis() - lastTSLCheckTime > 1000 && tslEnabled) {
        updateLux();
        lastTSLCheckTime = millis();
    }

    // Update display brightness
    if (millis() - lastAdjustBrightnessTime > 10 &&
        currentBrightness != desiredBrightness) {
        if (currentBrightness > desiredBrightness) {
            currentBrightness--;
        } else {
            currentBrightness++;
        }
        matrix.setBrightness8(currentBrightness);
        lastAdjustBrightnessTime = millis();
    }

    // decode schedule
    if (needToDecodeSchedule && client.connected()) {
        Log.traceln("[smx/schedule] decoding");
        needToDecodeSchedule = false;
        File scheduleFile;
        if (LittleFS.exists("/app/schedule.json.tmp")) {
            Log.traceln("[smx/schedule] using tmp schedule");
            scheduleFile = LittleFS.open("/app/schedule.json.tmp", FILE_READ);
        } else {
            if (LittleFS.exists("/app/schedule.json")) {
                Log.traceln("[smx/schedule] using cached schedule");
                scheduleFile = LittleFS.open("/app/schedule.json", FILE_READ);
            } else {
                return;
            }
        }

        DeserializationError error = deserializeJson(docIn, scheduleFile);

        if (error) {
            Log.traceln("[smx/schedule] decode error");
            docOut.clear();
            docOut["type"] = "error";
            docOut["info"] = "schedule_decode_error";
            serializeJson(docOut, jsonMessageBuf);
            publish(statusTopic, jsonMessageBuf);
            return;
        } else {
            JsonArray array = docIn["items"].as<JsonArray>();
            int i = 0;
            scheduledItemsCount = array.size();
            Log.traceln("[smx/schedule] decoded schedule, %d items",
                        scheduledItemsCount);
            for (JsonObject item : array) {
                durations[i] = item["d"];
                skipStates[i] = item["s"];
                pinStates[i] = item["p"];
                i++;
            }

            scheduleFile.close();
            LittleFS.rename("/app/schedule.json.tmp", "/app/schedule.json");

            if (LittleFS.exists("/app/schedule.hash")) {
                LittleFS.remove("/app/schedule.hash");
            }

            Log.traceln("[smx/schedule] writing hash: %s", docIn["hash"]);

            File hashFile = LittleFS.open("/app/schedule.hash", FILE_WRITE);
            hashFile.write(docIn["hash"]);
            hashFile.close();

            docOut.clear();
            docOut["type"] = "success";
            docOut["info"] = "schedule_received";
            docOut["hash"] = docIn["hash"];
            serializeJson(docOut, jsonMessageBuf);

            docIn.clear();
            docIn.garbageCollect();

            publish(statusTopic, jsonMessageBuf);
        }
    }

    // show full boot anim
    if (!WiFi.isConnected() && millis() > 5700) {
        Log.traceln("[smx/wifi] wifi task");
        if (!hasSentBootMessage) {
            showAppletAsync("connect_wifi");
        }
        wifiManager.setConnectTimeout(30);
        wifiManager.setConfigPortalTimeout(120);
        wifiManager.setAPCallback(configModeCallback);
        wifiManager.setSaveConfigCallback(saveConfigCallback);
        wifiManager.autoConnect(hostName);
    }

    // if applet had an error
    if (needForceUpdateApplet) {
        needForceUpdateApplet = false;
        docOut.clear();
        docOut["type"] = "error";
        docOut["info"] = "malformed_applet";
        docOut["appid"] = forceUpdateAppletID;
        serializeJson(docOut, jsonMessageBuf);
        publish(statusTopic, jsonMessageBuf);
    }
}